src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_УрокиВРасчетахЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_УрокиВРасчетахЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Урок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Номер = Данные.Номер;
	Пока Лев(Номер, 1) = "0" Цикл 
		Номер = Прав(Номер, СтрДлина(Номер) - 1);
	КонецЦикла;

	Представление = "Урок " +Номер+ " от " +Формат(Данные.Дата,"ДФ='д.ММ.гг (Ч:мм) (ддд)'")+ " "
	+Данные.Ссылка.ПредметОбучения; 
	
КонецПроцедуры

//B07: ставка педагога урока по умолчанию. Урок, созданный программно (панель ученика, помощник, календарь,
//обработки), ставку не получал и начислял педагогу 0. Одна функция для всех маршрутов: заполняет только пустую
//ставку (выбранную вручную не трогает); запись нового урока зовёт её сама.
Процедура ЗаполнитьСтавкуПедагога(Объект) Экспорт

	Если ЗначениеЗаполнено(Объект.СтавкаПедагога) Или Не ЗначениеЗаполнено(Объект.Педагог) Тогда
		Возврат;
	КонецЕсли;
	Объект.СтавкаПедагога = СтавкаПедагогаПоУмолчанию(Объект.Педагог, Объект.ГруппаОбучения);

КонецПроцедуры

//Ставка урока по умолчанию — как «ставка по виду работ» в типовых: у группы задана «Ставка педагога» — групповой
//урок начисляет по ней (педагог ведёт индивидуальные уроки «за час», а группы — «с человека»); иначе — ставка из
//карточки педагога. Одна функция для формы урока, календаря, помощника, панели и записи урока.
Функция СтавкаПедагогаПоУмолчанию(Педагог, ГруппаОбучения = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ГруппаОбучения) И ЗначениеЗаполнено(ГруппаОбучения.СтавкаПедагога) Тогда
		Возврат ГруппаОбучения.СтавкаПедагога;
	КонецЕсли;
	Если ЗначениеЗаполнено(Педагог) Тогда
		Возврат Педагог.СтавкаПедагога;
	КонецЕсли;
	Возврат Справочники.УЗ_СтавкиПедагогов.ПустаяСсылка();

КонецФункции

//Смена педагога урока (форма): ставка — по умолчанию для нового педагога и группы урока, начисления пересчитываются;
//ручные доплаты и удержания (строки без «#») остаются — прежде форма очищала всю таблицу начислений.
Процедура ПриСменеПедагога(Объект) Экспорт

	Объект.СтавкаПедагога = СтавкаПедагогаПоУмолчанию(Объект.Педагог, Объект.ГруппаОбучения);
	ПересчитатьНачисленияПедагога(Объект);

КонецПроцедуры

Процедура ПересчитатьНачисленияПедагога(Объект) Экспорт
	        	
	ВремСтараяТЗ = Объект.НачисленияПедагогу.Выгрузить();
	
	Объект.НачисленияПедагогу.Очистить();
	
	Ставка = Объект.СтавкаПедагога;
	
	//В6 (решение владельца 28.09.2026): урок без единой явки не считается проведённым — «за занятие» и «за час»
	//не начисляются; «с человека» — по явке; «% с оплаты» — от суммы оплаты учеников (оплаченная неявка тоже)
	КоличествоЯвок = 0;
	КоличествоОплат = 0;
	Для Каждого СтрУч из Объект.Ученики Цикл
		Если СтрУч.Явка Тогда
			КоличествоЯвок = КоличествоЯвок + 1;
		КонецЕсли;
		Если СтрУч.СписатьОплату Тогда
			КоличествоОплат = КоличествоОплат + 1;
		КонецЕсли;
	КонецЦикла;
	
	//«Не изменять» у автоматического начисления (комментарий с «#») — строка остаётся как есть, ставка его не
	//пересчитывает (прежде отметка на пересчёт не влияла: строки с «#» всегда считались заново)
	Зафиксировано = Ложь;
	Для Каждого СтрокаСтаройТЗ Из ВремСтараяТЗ Цикл
		Если СтрокаСтаройТЗ.НеИзменять И СтрНайти(СтрокаСтаройТЗ.Комментарий, "#") > 0 Тогда
			Зафиксировано = Истина;
			НовНачисление = Объект.НачисленияПедагогу.Добавить();
			НовНачисление.СуммаНачисления 	= СтрокаСтаройТЗ.СуммаНачисления;
			НовНачисление.Комментарий 		= СтрокаСтаройТЗ.Комментарий;
			НовНачисление.НеИзменять 		= Истина;
		КонецЕсли;
	КонецЦикла;

	Если НЕ Ставка.Пустая() И НЕ Зафиксировано И СтавкаДействуетНаДату(Ставка, Объект.Дата) Тогда

		СуммаНачисления = 0;
		Если Ставка.ОплатаСЧеловека > 0 Тогда
			СуммаНачисления = КоличествоЯвок * Ставка.ОплатаСЧеловека;
			Комментарий 	= "#ОплатаСЧеловека (" + КоличествоЯвок + " уч.)";
		ИначеЕсли Ставка.ПроцентСОплатыУченика > 0 Тогда
			//В15: процент — от оплаты учеников (сумма строк после скидки), материалы и доп. расходы не вычитаются
			СуммаНачисления = Окр(Объект.Ученики.Итог("Сумма") * Ставка.ПроцентСОплатыУченика / 100, 2);
			Комментарий 	= "#ПроцентСОплатыУченика (" + КоличествоОплат + " уч.)";
		ИначеЕсли Ставка.ОплатаЗаЗанятие > 0 Тогда
			СуммаНачисления = ?(КоличествоЯвок > 0, Ставка.ОплатаЗаЗанятие, 0);
			Комментарий 	= "#ОплатаЗаЗанятие";
		ИначеЕсли Ставка.ОплатаЗаЧас > 0 Тогда
			СуммаНачисления = ?(КоличествоЯвок > 0, Окр(Ставка.ОплатаЗаЧас * ЧасовУрока(Объект.КоличествоЧасов), 2), 0); //В13: от целых минут
			Комментарий 	= "#ОплатаЗаЧас";
		КонецЕсли;
		
		Если СуммаНачисления <> 0 Тогда
			НовНачисление = Объект.НачисленияПедагогу.Добавить();
			НовНачисление.СуммаНачисления 	= СуммаНачисления;
			НовНачисление.Комментарий 		= Комментарий;
		КонецЕсли;
		
	КонецЕсли; 		
	
	// Возвращаем ручные начисления (без пометки "#"). B06: ручная доплата без комментария тоже остаётся —
	// прежде строка без комментария выбрасывалась при каждой записи урока, даже с "Не изменять"; пропускаются
	// только пустые строки (без комментария и без суммы)
	Для Каждого СтрокаСтаройТЗ из ВремСтараяТЗ Цикл		
		Если СтрНайти(СтрокаСтаройТЗ.Комментарий,"#")>0
			Или Не ЗначениеЗаполнено(СтрокаСтаройТЗ.Комментарий) И СтрокаСтаройТЗ.СуммаНачисления = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовНачисление = Объект.НачисленияПедагогу.Добавить();
		НовНачисление.СуммаНачисления 	= СтрокаСтаройТЗ.СуммаНачисления;
		НовНачисление.Комментарий 		= СтрокаСтаройТЗ.Комментарий;
		НовНачисление.НеИзменять 		= СтрокаСтаройТЗ.НеИзменять; 		
	КонецЦикла; 	
	
КонецПроцедуры

//Проведённый расчёт зарплаты, в ведомость которого вошёл урок (В9): Структура(Номер, Дата) или Неопределено.
//Читается регистр УЗ_УрокиВРасчетахЗарплаты (движения расчёта) — он виден и менеджеру, которому сами расчёты
//зарплаты не видны (права): проверка при записи урока работает у всех. Урок с проведённой выплатой всегда в
//проведённом расчёте (оплаченный расчёт не отменяется, N01).
Функция РасчетЗарплатыСУроком(СсылкаУрока) Экспорт

	Если Не ЗначениеЗаполнено(СсылкаУрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Уроки.НомерРасчета КАК Номер,
	|	Уроки.ДатаРасчета КАК Дата
	|ИЗ
	|	РегистрСведений.УЗ_УрокиВРасчетахЗарплаты КАК Уроки
	|ГДЕ
	|	Уроки.Урок = &Урок
	|	И Уроки.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уроки.ДатаРасчета";
	Запрос.УстановитьПараметр("Урок", СсылкаУрока);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("Номер, Дата", НомерБезНулей(Выборка.Номер), Выборка.Дата);

КонецФункции

//Действует ли ставка педагога на дату урока: «Действует с» / «по» (границы включительно, пустая — без ограничения).
//Ставка вне срока не начисляет — прежде срок ставки нигде не учитывался.
Функция СтавкаДействуетНаДату(Ставка, Дата) Экспорт

	Если ЗначениеЗаполнено(Ставка.НачалоДействия) И Дата < НачалоДня(Ставка.НачалоДействия) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Ставка.ОкончаниеДействия) И Дата > КонецДня(Ставка.ОкончаниеДействия) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

//Цена тарифа на дату: Структура(Сумма, КоличествоЧасов, КоличествоУроков) или Неопределено — цены нет.
//Цена всегда на дату урока — последняя запись регистра УЗ_ЦеныТарифов на дату. Р2/В8 (как в типовых): смена
//одной цены в карточке тарифа тоже пишется в регистр с даты (РегистрыСведений.УЗ_ЦеныТарифов.ЗафиксироватьЦенуКарточки),
//поэтому перепроведение старого урока берёт цену его даты, а не новую. Тариф без истории цен, у которого записей
//на дату нет (цену карточки ни разу не меняли), — цена из карточки (так её и показывает представление тарифа).
//Запись с суммой 0 — явно бесплатный тариф: цена есть и равна нулю. Нет цены — урок «К оплате» не проводится.
Функция ЦенаТарифаНаДату(Тариф, Дата) Экспорт

	ЦенаНаДату = РегистрыСведений.УЗ_ЦеныТарифов.ПолучитьСуммуТарифаНаДату(Тариф, Дата);
	Если ЦенаНаДату <> Неопределено Или Тариф.ИспользоватьИсториюЦен Тогда
		Возврат ЦенаНаДату;
	КонецЕсли;

	Если РегистрыСведений.УЗ_ЦеныТарифов.ЦенаКарточкиЗаполнена(Тариф) Тогда
		Возврат Новый Структура("Сумма, КоличествоЧасов, КоличествоУроков",
			Тариф.Сумма, Тариф.КоличествоЧасов, Тариф.КоличествоУроков);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

//Текст отказа для строки учеников, у тарифа которой нет цены на дату урока.
Функция ТекстНетЦеныТарифа(Тариф, Дата, НомерСтроки) Экспорт

	Возврат СтрШаблон("Строка %1: у тарифа «%2» нет цены на %3. Укажите цену в карточке тарифа или снимите отметку «К оплате»",
		НомерСтроки, Тариф, Формат(Дата, "ДЛФ=D"));

КонецФункции

//Сумма скидки строки урока: от 0 до цены (скидка не делает сумму отрицательной).
//Нет скидки или оба коэффициента 0 — 0. Скидка вне срока действия (ПериодДействияС/По, границы включительно) — Неопределено.
Функция СуммаСкидки(Скидка, Цена, Дата) Экспорт

	Если Не ЗначениеЗаполнено(Скидка) Тогда
		Возврат 0;
	КонецЕсли;

	Если ЗначениеЗаполнено(Скидка.ПериодДействияС) И Дата < НачалоДня(Скидка.ПериодДействияС)
		Или ЗначениеЗаполнено(Скидка.ПериодДействияПо) И Дата > КонецДня(Скидка.ПериодДействияПо) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Скидка.КоэффициентСумма <> 0 Тогда
		Результат = Скидка.КоэффициентСумма;
	ИначеЕсли Скидка.КоэффициентПроцент <> 0 Тогда
		Результат = Цена / 100 * Скидка.КоэффициентПроцент;
	Иначе
		Результат = 0;
	КонецЕсли;

	Возврат Макс(0, Мин(Результат, Цена));

КонецФункции

Функция ТекстСкидкаВнеСрока(Скидка, Дата, НомерСтроки) Экспорт

	Возврат СтрШаблон("Строка %1: скидка «%2» на %3 не действует (срок действия с %4 по %5) — не применена",
		НомерСтроки, Скидка, Формат(Дата, "ДЛФ=D"),
		?(ЗначениеЗаполнено(Скидка.ПериодДействияС), Формат(Скидка.ПериодДействияС, "ДЛФ=D"), "…"),
		?(ЗначениеЗаполнено(Скидка.ПериодДействияПо), Формат(Скидка.ПериодДействияПо, "ДЛФ=D"), "…"));

КонецФункции

//Цена одного урока по тарифу на дату: уроковый тариф — сумма / число уроков, часовой — пропорционально часам урока.
//Неопределено — у тарифа нет цены на дату (или цена без единицы, или часовой тариф при уроке 0 ч — В25).
Функция ЦенаУрокаПоТарифу(Тариф, Дата, КоличествоЧасов) Экспорт

	Итог = ЦенаЕдиницыПоТарифу(ЦенаТарифаНаДату(Тариф, Дата), КоличествоЧасов);
	Возврат ?(Итог.ТекстОшибки = "", Итог.Цена, Неопределено);

КонецФункции

//Цена урока по цене тарифа (Структура(Сумма, КоличествоЧасов, КоличествоУроков) или Неопределено) — одно правило
//единиц для урока, подсказок и представления тарифа: сначала «за уроки», затем «за часы».
//Возврат: Структура(Цена, Единица, ТекстОшибки): Единица — "урок" / "час" / "бесплатно" / ""; ТекстОшибки — "" или
//почему цены нет («нет цены», «нет единицы», «часовой тариф при уроке 0 ч» — В25).
Функция ЦенаЕдиницыПоТарифу(ЦенаТарифа, КоличествоЧасов)

	Итог = Новый Структура("Цена, Единица, ТекстОшибки", 0, "", "");
	Если ЦенаТарифа = Неопределено Тогда
		Итог.ТекстОшибки = "нет цены";
	ИначеЕсли ЦенаТарифа.Сумма = 0 Тогда
		Итог.Единица = "бесплатно"; //явно бесплатная цена (запись истории с суммой 0)
	ИначеЕсли ЦенаТарифа.КоличествоУроков > 0 Тогда
		Итог.Единица = "урок";
		Итог.Цена = ЦенаТарифа.Сумма / ЦенаТарифа.КоличествоУроков;
	ИначеЕсли ЦенаТарифа.КоличествоЧасов > 0 Тогда
		Итог.Единица = "час";
		//и часы урока, и часы тарифа — целыми минутами (В13/В25): «1 000 за 40 мин» (0,6667 ч) — урок 40 мин ровно 1 000
		ЧасовТарифа = ЧасовУрока(ЦенаТарифа.КоличествоЧасов);
		Если ЧасовУрока(КоличествоЧасов) <= 0 Тогда
			Итог.ТекстОшибки = "урок 0 ч";
		ИначеЕсли ЧасовТарифа <= 0 Тогда
			Итог.ТекстОшибки = "нет единицы";
		Иначе
			Итог.Цена = ЦенаТарифа.Сумма * ЧасовУрока(КоличествоЧасов) / ЧасовТарифа;
		КонецЕсли;
	Иначе
		Итог.ТекстОшибки = "нет единицы";
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Подсказка цены тарифа — одинаковая в форме тарифа, форме записи цены, помощнике уроков и представлении тарифа:
//«1 000,00 за 1 урок (8 000,00 / 8 ур.)» или «1 000,00 за 1 час (1 000,00 / 1 ч.)». Порядок единиц — как считает
//урок (ЦенаЕдиницыПоТарифу): сначала уроки, затем часы. Цена — Структура(Сумма, КоличествоЧасов, КоличествоУроков).
Функция ПредставлениеЦеныТарифа(Цена, Кратко = Ложь) Экспорт

	Если Цена = Неопределено Тогда
		Возврат НСтр("ru = 'нет цены'");
	ИначеЕсли Цена.Сумма = 0 Тогда
		Возврат НСтр("ru = 'Бесплатно'");
	ИначеЕсли Цена.КоличествоУроков > 0 Тогда
		Возврат Формат(Цена.Сумма / Цена.КоличествоУроков, "ЧДЦ=2") + " за 1 урок" + ?(Кратко, "",
			" (" + Формат(Цена.Сумма, "ЧДЦ=2") + " / " + Цена.КоличествоУроков + " ур.)");
	ИначеЕсли ЧасовУрока(Цена.КоличествоЧасов) > 0 Тогда
		Возврат Формат(Цена.Сумма / ЧасовУрока(Цена.КоличествоЧасов), "ЧДЦ=2") + " за 1 час" + ?(Кратко, "",
			" (" + Формат(Цена.Сумма, "ЧДЦ=2") + " / " + Формат(Цена.КоличествоЧасов, "ЧГ=") + " ч.)");
	КонецЕсли;
	Возврат НСтр("ru = 'нет цены: не указано количество уроков или часов'");

КонецФункции

//Подсказка цены тарифа на дату (история цен или карточка — как урок, ЦенаТарифаНаДату).
Функция ПредставлениеЦеныТарифаНаДату(Тариф, Дата) Экспорт

	Если Не ЗначениеЗаполнено(Тариф) Тогда
		Возврат "";
	КонецЕсли;
	Возврат ПредставлениеЦеныТарифа(ЦенаТарифаНаДату(Тариф, Дата));

КонецФункции

//Сумма всего тарифа на дату (цена пакета «N ₽ за K уроков»), 0 — цены нет. Для ПКО «По тарифу»: прежде ПКО брал
//сумму карточки без даты — у тарифа с историей цен 0 или устаревшую цену.
Функция СуммаТарифаНаДату(Тариф, Дата) Экспорт

	Цена = ЦенаТарифаНаДату(Тариф, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Возврат ?(Цена = Неопределено, 0, Цена.Сумма);

КонецФункции

//Цена единицы тарифа на дату — для остатка «N уроков / N ч» (карточка ученика, панель): Структура(Цена, Единица),
//Единица "ур." / "ч."; Неопределено — цены нет или тариф бесплатный.
Функция ЦенаЕдиницыТарифа(Тариф, Дата) Экспорт

	Цена = ЦенаТарифаНаДату(Тариф, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Если Цена = Неопределено Или Цена.Сумма = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Цена.КоличествоУроков > 0 Тогда
		Возврат Новый Структура("Цена, Единица", Цена.Сумма / Цена.КоличествоУроков, "ур.");
	ИначеЕсли ЧасовУрока(Цена.КоличествоЧасов) > 0 Тогда
		Возврат Новый Структура("Цена, Единица", Цена.Сумма / ЧасовУрока(Цена.КоличествоЧасов), "ч.");
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

//В20 (решение владельца 28.09.2026): тариф строки ученика по умолчанию — индивидуальный тариф ученика
//(личная договорённость важнее общей), иначе тариф группы, иначе тариф урока. Одна функция для формы урока,
//помощника уроков и панели ученика (прежде у панели тариф группы был важнее личного). Абонемент строки ещё
//важнее тарифа — это уже цена (ЦенаСтрокиУрока).
Функция ТарифСтрокиУченика(Ученик, ГруппаОбучения = Неопределено, ТарифУрока = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Ученик) И ЗначениеЗаполнено(Ученик.Тариф) Тогда
		Возврат Ученик.Тариф;
	ИначеЕсли ЗначениеЗаполнено(ГруппаОбучения) И ЗначениеЗаполнено(ГруппаОбучения.Тариф) Тогда
		Возврат ГруппаОбучения.Тариф;
	ИначеЕсли ЗначениеЗаполнено(ТарифУрока) Тогда
		Возврат ТарифУрока;
	КонецЕсли;
	Возврат Справочники.УЗ_Тарифы.ПустаяСсылка();

КонецФункции

//Цена строки урока — ЕДИНАЯ функция (форма урока, запись и проведение урока, помощник, панель, обработки):
//  1. без «К оплате» — 0 (бесплатное занятие);
//  2. абонемент строки (этого ученика, предмет урока или без предмета, с ценой) — В2: цена абонемента / число
//     занятий, часовой — цена × часы урока / часы абонемента; хвост округления — на последнее занятие (часы):
//     сумма уроков по абонементу = цене абонемента (В25); скидка строки к абонементу НЕ применяется — она уже в
//     цене абонемента (В23, как в типовых: скидка при продаже);
//  3. иначе тариф строки на дату урока (В8): «за уроки» — сумма / уроки, «за часы» — сумма × часы урока / часы
//     (В13: от целых минут); урок 0 ч по часовому тарифу или абонементу — цены нет (В25), не бесплатно;
//     скидка строки — с каждой строки: процент от цены, рубли — со строки (В23), в пределах [0; цена];
//  4. деньги — до копеек (цена, скидка, сумма = цена − скидка); «Использовать округление» — цена и скидка до
//     рубля, сумма — разностью (цена = сумма + скидка всегда).
//Параметры:
//  Стр - строка «Ученики» или Структура: Ученик, Тариф, Абонемент, Скидка, СписатьОплату
//  Урок - объект урока или Структура: Ссылка, Дата, КоличествоЧасов, ПредметОбучения
//  ИспользованоВДокументе - Соответствие Абонемент → Структура(Уроков, Секунд, Сумма) строк выше в этом уроке
//  ИспользоватьОкругление - Булево, Неопределено — из настроек учёта
//Возврат: Структура — Цена, СуммаСкидки, Сумма; Источник ("Бесплатно", "Абонемент", "Тариф", "НетЦены");
//  ТекстОшибки — почему «К оплате» без цены (для отказа проведения) или ""; СкидкаВнеСрока — Булево.
Функция ЦенаСтрокиУрока(Стр, Урок, ИспользованоВДокументе = Неопределено, ИспользоватьОкругление = Неопределено) Экспорт

	Итог = Новый Структура("Цена, СуммаСкидки, Сумма, Источник, ТекстОшибки, СкидкаВнеСрока", 0, 0, 0, "Бесплатно", "", Ложь);
	Если ИспользоватьОкругление = Неопределено Тогда
		ИспользоватьОкругление = ИспользоватьОкруглениеЦен();
	КонецЕсли;
	Если Не Стр.СписатьОплату Тогда
		Возврат Итог;
	КонецЕсли;

	НомерСтроки = ?(ЕстьСвойство(Стр, "НомерСтроки"), Стр.НомерСтроки, 1);
	Если АбонементПодходитКУроку(Стр.Абонемент, Стр.Ученик, Урок.ПредметОбучения)
		И Стр.Абонемент.ЦенаАбонемента > 0
		И (Стр.Абонемент.КоличествоЗанятий > 0 Или Стр.Абонемент.КоличествоЧасов > 0) Тогда
		Итог.Источник = "Абонемент";
		ЦенаПоАбонементу(Итог, Стр.Абонемент, Урок, ИспользованоВДокументе, ИспользоватьОкругление, НомерСтроки);
		Итог.Сумма = Итог.Цена;
		Возврат Итог;
	КонецЕсли;

	Итог.Источник = "Тариф";
	Если Не ЗначениеЗаполнено(Стр.Тариф) Тогда
		Итог.Источник = "НетЦены";
		Итог.ТекстОшибки = СтрШаблон(НСтр("ru = 'Строка %1: ученик %2 отмечен «К оплате», но тариф не указан — цены нет. Укажите тариф или снимите отметку «К оплате»'"),
			НомерСтроки, Стр.Ученик);
		Возврат Итог;
	КонецЕсли;
	ПоТарифу = ЦенаЕдиницыПоТарифу(ЦенаТарифаНаДату(Стр.Тариф, Урок.Дата), Урок.КоличествоЧасов);
	Если ПоТарифу.ТекстОшибки = "урок 0 ч" Тогда
		Итог.Источник = "НетЦены";
		Итог.ТекстОшибки = СтрШаблон(НСтр("ru = 'Строка %1: тариф «%2» — за час, а длительность урока 0 ч: цена 0 молча сделала бы урок бесплатным. Укажите длительность урока или снимите отметку «К оплате»'"),
			НомерСтроки, Стр.Тариф);
		Возврат Итог;
	ИначеЕсли ПоТарифу.ТекстОшибки <> "" Тогда
		Итог.Источник = "НетЦены";
		Итог.ТекстОшибки = ТекстНетЦеныТарифа(Стр.Тариф, Урок.Дата, НомерСтроки);
		Возврат Итог;
	КонецЕсли;

	Итог.Цена = ОкруглитьЦену(ПоТарифу.Цена, ИспользоватьОкругление);
	Если Итог.Цена <> 0 Тогда
		Скидка = СуммаСкидки(Стр.Скидка, Итог.Цена, Урок.Дата);
		Если Скидка = Неопределено Тогда
			Итог.СкидкаВнеСрока = Истина;
		Иначе
			Итог.СуммаСкидки = Мин(ОкруглитьЦену(Скидка, ИспользоватьОкругление), Итог.Цена);
		КонецЕсли;
	КонецЕсли;
	Итог.Сумма = Итог.Цена - Итог.СуммаСкидки;
	Возврат Итог;

КонецФункции

//Цена занятия по абонементу строки (В2, хвост округления — В25) → Итог.Цена или Итог.ТекстОшибки.
Процедура ЦенаПоАбонементу(Итог, Абонемент, Урок, ИспользованоВДокументе, ИспользоватьОкругление, НомерСтроки)

	ЦенаАбонемента = Абонемент.ЦенаАбонемента;
	СекундЭтого = СекундУрока(Урок.КоличествоЧасов);
	Если Абонемент.КоличествоЗанятий = 0 И СекундЭтого = 0 Тогда
		Итог.Источник = "НетЦены";
		Итог.ТекстОшибки = СтрШаблон(НСтр("ru = 'Строка %1: абонемент «%2» — по часам, а длительность урока 0 ч: списать нечего. Укажите длительность урока или снимите отметку «К оплате»'"),
			НомерСтроки, Абонемент);
		Возврат;
	КонецЕсли;

	Прежде = ИспользованоПоАбонементу(Абонемент, Урок.Ссылка);
	ВДокументе = ?(ИспользованоВДокументе = Неопределено, Неопределено, ИспользованоВДокументе[Абонемент]);
	Если ВДокументе = Неопределено Тогда
		ВДокументе = Новый Структура("Уроков, Секунд, Сумма", 0, 0, 0);
		Если ИспользованоВДокументе <> Неопределено Тогда
			ИспользованоВДокументе.Вставить(Абонемент, ВДокументе);
		КонецЕсли;
	КонецЕсли;
	Уроков = Прежде.Уроков + ВДокументе.Уроков;
	Секунд = Прежде.Секунд + ВДокументе.Секунд;
	Списано = Прежде.Сумма + ВДокументе.Сумма;

	Если Абонемент.КоличествоЗанятий > 0 Тогда
		Последнее = (Уроков + 1 = Абонемент.КоличествоЗанятий);
		Цена = ЦенаАбонемента / Абонемент.КоличествоЗанятий;
	Иначе
		Последнее = (Секунд + СекундЭтого = СекундУрока(Абонемент.КоличествоЧасов));
		Цена = ЦенаАбонемента * ЧасовУрока(Урок.КоличествоЧасов) / Макс(ЧасовУрока(Абонемент.КоличествоЧасов), 1 / 60);
	КонецЕсли;
	//последнее занятие забирает остаток цены: 1 000 / 3 = 333,33 + 333,33 + 333,34. Только хвост округления
	//(не больше рубля на занятие): прежние уроки, списанные по другой цене (старая скидка), хвостом не добираются
	Хвост = ЦенаАбонемента - Списано;
	Если Последнее И Хвост >= 0 И Макс(Хвост - Цена, Цена - Хвост) <= Уроков + 1 Тогда
		Итог.Цена = Хвост;
	Иначе
		Итог.Цена = ОкруглитьЦену(Цена, ИспользоватьОкругление);
	КонецЕсли;

	ВДокументе.Уроков = ВДокументе.Уроков + 1;
	ВДокументе.Секунд = ВДокументе.Секунд + СекундЭтого;
	ВДокументе.Сумма = ВДокументе.Сумма + Итог.Цена;

КонецПроцедуры

//Сколько по абонементу уже списано другими документами: Уроков, Секунд, Сумма (расход регистра УЗ_СписанияСуммЗаУроки,
//без движений этого урока — при перепроведении они ещё в регистре).
Функция ИспользованоПоАбонементу(Абонемент, СсылкаУрока)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(-Движения.КоличествоУроков), 0) КАК Уроков,
	|	ЕСТЬNULL(СУММА(Движения.Часы), 0) КАК Секунд,
	|	ЕСТЬNULL(СУММА(Движения.Сумма), 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки КАК Движения
	|ГДЕ
	|	Движения.Абонемент = &Абонемент
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Движения.Активность
	|	И Движения.Регистратор <> &Ссылка";
	Запрос.УстановитьПараметр("Абонемент", Абонемент);
	Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(СсылкаУрока), СсылкаУрока, Неопределено));
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Новый Структура("Уроков, Секунд, Сумма", Выборка.Уроков, Выборка.Секунд, Выборка.Сумма);

КонецФункции

Функция ОкруглитьЦену(Сумма, ДоРубля)
	Возврат ?(ДоРубля, Окр(Сумма), Окр(Сумма, 2));
КонецФункции

Функция ИспользоватьОкруглениеЦен()

	LMНастроки = РегистрыСведений.УЗ_Настройки.Настройки();
	Возврат LMНастроки.Свойство("ИспользоватьОкругление") И LMНастроки.ИспользоватьОкругление = Истина;

КонецФункции

Функция ЕстьСвойство(Значение, Имя)

	Проба = Новый Структура(Имя, Null);
	ЗаполнитьЗначенияСвойств(Проба, Значение);
	Возврат Проба[Имя] <> Null;

КонецФункции

//В13 (решение владельца 28.09.2026): длительность урока — с точностью до минуты. Часы хранятся с 4 знаками
//(40 мин = 0,6667 ч, 50 мин = 0,8333 ч); время, секунды регистра и деньги считаются от целых минут, поэтому
//40 минут — ровно 2 400 секунд и 2/3 часа (1 000 ₽/ч → 666,67 ₽), а не 0,67 ч → 2 412 с и 670 ₽.
//Старые значения с 2 знаками (0,67, 0,83) округляются до тех же минут (40, 50).
Функция СекундУрока(КоличествоЧасов) Экспорт
	Возврат Окр(КоличествоЧасов * 60) * 60;
КонецФункции

//Точная доля часа по целым минутам урока — множитель для цены и оплаты «за час» (деньги потом — до копеек).
Функция ЧасовУрока(КоличествоЧасов) Экспорт
	Возврат Окр(КоличествоЧасов * 60) / 60;
КонецФункции

//Подходит ли абонемент строке урока для цены (Codex A08): абонемент этого ученика и того же предмета, что урок
//(абонемент без предмета — на любой предмет). Неподходящий абонемент проведение отклоняет (модуль объекта,
//ПроверитьАбонемент), а цену строка берёт по тарифу — прежде цена чужого предмета попадала в сумму урока.
Функция АбонементПодходитКУроку(Абонемент, Ученик, ПредметОбучения) Экспорт

	Если Не ЗначениеЗаполнено(Абонемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Абонемент.ФизЛицо = Ученик
		И (Не ЗначениеЗаполнено(Абонемент.ПредметОбучения) Или Абонемент.ПредметОбучения = ПредметОбучения);

КонецФункции


//В2 (решение владельца 28.09.2026, как в типовых): урок по абонементу стоит ЦенаАбонемента / КоличествоЗанятий,
//часовой абонемент — ЦенаАбонемента × часы урока / КоличествоЧасов. Неопределено — абонемента нет или у него нет
//цены или количества (тогда цена по тарифу).
Функция ЦенаУрокаПоАбонементу(Абонемент, КоличествоЧасов) Экспорт
	
	Если Не ЗначениеЗаполнено(Абонемент) Или Абонемент.ЦенаАбонемента <= 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Абонемент.КоличествоЗанятий > 0 Тогда
		Возврат Абонемент.ЦенаАбонемента / Абонемент.КоличествоЗанятий;
	ИначеЕсли Абонемент.КоличествоЧасов > 0 Тогда
		Возврат Абонемент.ЦенаАбонемента * ЧасовУрока(КоличествоЧасов) / Абонемент.КоличествоЧасов;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции
//В4 (решение владельца 28.09.2026): число дней приостановок абонемента — на них продлевается срок.
//Приостановка — с даты начала включительно по дату возобновления не включая; без даты возобновления
//(бессрочная) срок не продлевает — абонемент приостановлен до возобновления.
Функция ДнейПриостановкиАбонемента(Абонемент) Экспорт

	Дней = 0;
	Для Каждого СтрПриостановка Из Абонемент.Приостановки Цикл
		Если Не ЗначениеЗаполнено(СтрПриостановка.ДатаПриостановки)
			Или Не ЗначениеЗаполнено(СтрПриостановка.ДатаВозобновления) Тогда
			Продолжить;
		КонецЕсли;
		НачалоПриостановки = НачалоДня(СтрПриостановка.ДатаПриостановки);
		Возобновление = НачалоДня(СтрПриостановка.ДатаВозобновления);
		Если Возобновление > НачалоПриостановки Тогда
			Дней = Дней + (Возобновление - НачалоПриостановки) / 86400;
		КонецЕсли;
	КонецЦикла;
	Возврат Дней;

КонецФункции

//Срок абонемента с продлением на дни приостановок (начало дня последнего дня срока); пустая дата — бессрочный.
//Одна функция для урока, помощника уроков и подбора абонемента — срок везде считается одинаково.
Функция ДатаОкончанияАбонемента(Абонемент) Экспорт

	Если Не ЗначениеЗаполнено(Абонемент.ДатаОкончания) Тогда
		Возврат '00010101';
	КонецЕсли;
	Возврат НачалоДня(Абонемент.ДатаОкончания) + ДнейПриостановкиАбонемента(Абонемент) * 86400;

КонецФункции

//Приостановлен ли абонемент на день Дата (с даты приостановки включительно по дату возобновления не включая).
Функция АбонементПриостановленНаДату(Абонемент, Дата) Экспорт

	ДеньУрока = НачалоДня(Дата);
	Для Каждого СтрПриостановка Из Абонемент.Приостановки Цикл
		Если Не ЗначениеЗаполнено(СтрПриостановка.ДатаПриостановки) Тогда
			Продолжить;
		КонецЕсли;
		Если ДеньУрока >= НачалоДня(СтрПриостановка.ДатаПриостановки)
			И (Не ЗначениеЗаполнено(СтрПриостановка.ДатаВозобновления)
				Или ДеньУрока < НачалоДня(СтрПриостановка.ДатаВозобновления)) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

//Действующие на Дата абонементы учеников по предмету (или без предмета): активированы, не приостановлены,
//срок с продлением на дни приостановок (ДатаОкончанияАбонемента) не истёк. У ученика несколько — берётся тот,
//что кончается раньше (он первым и расходуется; бессрочный — последним).
//Возврат: Соответствие Ученик → Абонемент (ученика без действующего абонемента в нём нет).
Функция ДействующиеАбонементы(Ученики, ПредметОбучения, Дата) Экспорт

	Результат = Новый Соответствие;
	Если Ученики.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Абонементы.Ссылка КАК Абонемент,
	|	Абонементы.ФизЛицо КАК Ученик
	|ИЗ
	|	Справочник.УЗ_Абонемент КАК Абонементы
	|ГДЕ
	|	Абонементы.ФизЛицо В (&Ученики)
	|	И Абонементы.Активный
	|	И Абонементы.ДатаАктивации <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ Абонементы.ПометкаУдаления
	|	И (Абонементы.ПредметОбучения = &ПредметОбучения
	|			ИЛИ Абонементы.ПредметОбучения = ЗНАЧЕНИЕ(Справочник.УЗ_ПредметыОбучения.ПустаяСсылка))
	|	И Абонементы.ДатаНачала <= &Дата";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Запрос.УстановитьПараметр("ПредметОбучения", ПредметОбучения);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Выборка = Запрос.Выполнить().Выбрать();

	ДеньУрока = НачалоДня(Дата);
	СрокиВыбранных = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Абонемент = Выборка.Абонемент;
		Срок = ДатаОкончанияАбонемента(Абонемент);
		Если ЗначениеЗаполнено(Срок) И Срок < ДеньУрока
			Или АбонементПриостановленНаДату(Абонемент, ДеньУрока) Тогда
			Продолжить;
		КонецЕсли;
		Сравнить = ?(ЗначениеЗаполнено(Срок), Срок, '39991231');
		Прежний = СрокиВыбранных[Выборка.Ученик];
		Если Прежний = Неопределено Или Сравнить < Прежний Тогда
			Результат.Вставить(Выборка.Ученик, Абонемент);
			СрокиВыбранных.Вставить(Выборка.Ученик, Сравнить);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

//Цены строк учеников — по единой функции ЦенаСтрокиУрока (считаются заново при каждой записи: часы, дата, тариф,
//абонемент могли измениться; ручной цены нет). Сообщать = Ложь — без сообщений (при записи: отказ проведения
//сообщает ОбработкаПроведения). Возврат: Массив из Структура(НомерСтроки, Текст) — строки «К оплате» без цены.
Функция РассчитатьТабличнуюЧасть(Объект, Сообщать = Истина) Экспорт

	ИспользоватьОкругление = ИспользоватьОкруглениеЦен();
	ИспользованоВДокументе = Новый Соответствие;
	БезЦены = Новый Массив;
	Для Каждого Стр из Объект.Ученики Цикл

		Цена = ЦенаСтрокиУрока(Стр, Объект, ИспользованоВДокументе, ИспользоватьОкругление);
		Стр.ЦенаТарифа 	= Цена.Цена;
		Стр.СуммаСкидки = Цена.СуммаСкидки;
		Стр.Сумма 		= Цена.Сумма;

		ПутьСтроки = "Ученики[" + Формат(Стр.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]";
		Если Цена.ТекстОшибки <> "" Тогда
			БезЦены.Добавить(Новый Структура("НомерСтроки, Текст", Стр.НомерСтроки, Цена.ТекстОшибки));
			//сообщение — у поля «Тариф» этой строки; остальные строки считаются дальше
			Если Сообщать Тогда
				УЗ_ОбщийКлиентСервер.СообщитьПользователю(Цена.ТекстОшибки, ПутьСтроки + ".Тариф", "Объект");
			КонецЕсли;
		КонецЕсли;
		Если Цена.СкидкаВнеСрока И Сообщать Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(ТекстСкидкаВнеСрока(Стр.Скидка, Объект.Дата, Стр.НомерСтроки),
				ПутьСтроки + ".Скидка", "Объект");
		КонецЕсли;

	КонецЦикла;
	Возврат БезЦены;

КонецФункции

Функция ПроверитьДокументПоГрафикуРабочегоВремени(Объект) Экспорт
	
	//Проверка урока на график габочего времени педагога
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикРабочегоВремениПедагога.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_ГрафикРабочегоВремениПедагога КАК ГрафикРабочегоВремениПедагога
	|ГДЕ
	|	ГрафикРабочегоВремениПедагога.Проведен
	|	И ГрафикРабочегоВремениПедагога.Педагог = &Педагог
	|	И ГрафикРабочегоВремениПедагога.Дата = &Дата";	
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Педагог", Объект.Педагог); 	
	ГрафикиРабочегоВремени = Запрос.Выполнить().Выгрузить();
	
	Если ГрафикиРабочегоВремени.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикРабочегоВремениПедагогаТЧ.Дата КАК Дата,
		|	ГрафикРабочегоВремениПедагогаТЧ.ВремяНачала КАК ВремяНачала,
		|	ГрафикРабочегоВремениПедагогаТЧ.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Документ.УЗ_ГрафикРабочегоВремениПедагога.ТЧ КАК ГрафикРабочегоВремениПедагогаТЧ
		|ГДЕ
		|	ГрафикРабочегоВремениПедагогаТЧ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ГрафикРабочегоВремениПедагогаТЧ.ВремяНачала <= &НачалоУрока
		|	И ГрафикРабочегоВремениПедагогаТЧ.ВремяОкончания >= &КонецУрока
		|	И ГрафикРабочегоВремениПедагогаТЧ.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Ссылка", ГрафикиРабочегоВремени[0].Ссылка);
		//урок целиком в рабочем интервале: и начало, и конец (прежде проверялся только конец урока — урок,
		//начатый раньше рабочего времени, не предупреждался). Время графика хранится датой 01.01.0001.
		НачалоУрока = '00010101' + (Объект.Дата - НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("НачалоУрока", НачалоУрока);
		Запрос.УстановитьПараметр("КонецУрока", НачалоУрока + СекундУрока(Объект.КоличествоЧасов));
		
		СвободныеПериоды = Запрос.Выполнить().Выгрузить();
		
		Если СвободныеПериоды.Количество()>0 Тогда //То есть существует документ ГрафикУчетаРабВремени
			
		Иначе
			ДанныеС = Новый Структура;
			ДанныеС.Вставить("Ссылка",ГрафикиРабочегоВремени[0].Ссылка);
			ДанныеС.Вставить("Педагог",ГрафикиРабочегоВремени[0].Ссылка.Педагог);
			ДанныеС.Вставить("Дата",ГрафикиРабочегоВремени[0].Ссылка.Дата);
			Возврат ДанныеС;
		КонецЕсли;
	КонецЕсли;
	
	//1. Найти все интервалы даты и время Педагога в графике
	//2. Проверить этот урок в интервале   
	Возврат Неопределено;

КонецФункции

//Проведённый урок того же педагога или в том же помещении, интервал которого пересекается с интервалом Объекта:
//чужое начало раньше нашего конца И чужой конец позже нашего начала (ловит и вложенный, и накрывающий урок;
//стык 12:00 после урока до 12:00 — не пересечение). Урок 0 ч занимает 1 секунду.
//Конец чужого урока в запросе — часы × 3 600 минус 30 секунд (В13): часы хранятся с 4 знаками, 40 мин = 0,6667 ч =
//2 400,12 с; начала уроков — ровно минуты, поэтому полминуты допуска не ловят стык и не пропускают пересечение
//на минуту (округление ВЫРАЗИТЬ в запросе у разных СУБД разное — на него не полагаемся).
//Помещение не проверяется, если оно пустое или у него флаг «Не контролировать пересечения».
//Возврат: Структура(Ссылка, Номер, Дата, КоличествоЧасов, Педагог, Помещение, Поле) — Поле "Педагог"/"Помещение" —
//или Неопределено.
//ВключаяЗаписанные — Истина: и записанные планом (непроведённые, не помеченные на удаление) уроки — помощник
//уроков так не создаёт будущий урок поверх чужого (Codex N03); проведение проверяет только проведённые.
Функция ДокументПересекаетсяСДругими(Объект, ВключаяЗаписанные = Ложь) Экспорт

	ПроверятьПедагога 	= ЗначениеЗаполнено(Объект.Педагог);
	ПроверятьПомещение 	= ЗначениеЗаполнено(Объект.Помещение)
		И Не Объект.Помещение.НеКонтролироватьПересечения;
	Если Не ПроверятьПедагога И Не ПроверятьПомещение Тогда
		Возврат Неопределено;
	КонецЕсли;

	Начало 		= Объект.Дата;
	Окончание 	= Объект.Дата + Макс(СекундУрока(Объект.КоличествоЧасов), 1);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Урок.Ссылка КАК Ссылка,
	|	Урок.Номер КАК Номер,
	|	Урок.Дата КАК Дата,
	|	Урок.КоличествоЧасов КАК КоличествоЧасов,
	|	Урок.Педагог КАК Педагог,
	|	Урок.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА &ПроверятьПедагога
	|				И Урок.Педагог = &Педагог
	|			ТОГДА ""Педагог""
	|		ИНАЧЕ ""Помещение""
	|	КОНЕЦ КАК Поле,
	|	ВЫБОР
	|		КОГДА &ПроверятьПедагога
	|				И Урок.Педагог = &Педагог
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	(Урок.Проведен
	|			ИЛИ &ВключаяЗаписанные
	|				И НЕ Урок.ПометкаУдаления)
	|	И Урок.Ссылка <> &Ссылка
	|	И Урок.Дата > &НачалоПоиска
	|	И Урок.Дата < &Окончание
	|	И ДОБАВИТЬКДАТЕ(Урок.Дата, СЕКУНДА, ВЫБОР
	|				КОГДА Урок.КоличествоЧасов > 0
	|					ТОГДА Урок.КоличествоЧасов * 3600 - 30
	|				ИНАЧЕ 1
	|			КОНЕЦ) > &Начало
	|	И (&ПроверятьПедагога
	|				И Урок.Педагог = &Педагог
	|			ИЛИ &ПроверятьПомещение
	|				И Урок.Помещение = &Помещение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Дата";
	//сначала пересечение по педагогу, затем по помещению
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Педагог", Объект.Педагог);
	Запрос.УстановитьПараметр("Помещение", Объект.Помещение);
	Запрос.УстановитьПараметр("ПроверятьПедагога", ПроверятьПедагога);
	Запрос.УстановитьПараметр("ПроверятьПомещение", ПроверятьПомещение);
	Запрос.УстановитьПараметр("ВключаяЗаписанные", ВключаяЗаписанные);
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Окончание", Окончание);
	//урок длиннее суток не бывает — поиск ограничен сутками до начала (индекс по дате)
	Запрос.УстановитьПараметр("НачалоПоиска", Начало - 86400);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура("Ссылка, Номер, Дата, КоличествоЧасов, Педагог, Помещение, Поле");
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Возврат Результат;

КонецФункции

//Номер документа без лидирующих нулей.
Функция НомерБезНулей(Номер)

	Результат = СокрЛП(Номер);
	Пока СтрНачинаетсяС(Результат, "0") Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	Возврат Результат;

КонецФункции

//Проверки расписания при проведении. Пересечение по педагогу/помещению — отказ с сообщением у поля
//«Педагог»/«Помещение»; выход за график рабочего времени педагога — только предупреждение.
Процедура ПроверкаПересечений(Объект, Отказ = Ложь) Экспорт

	Номер = НомерБезНулей(Объект.Номер);

	Если ЗначениеЗаполнено(Объект.Педагог) Тогда
		ИтогПроверки = ПроверитьДокументПоГрафикуРабочегоВремени(Объект);
		Если ИтогПроверки <> Неопределено Тогда
			ТекстСообщения = "Урок № " + Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " с " + Формат(Объект.Дата, "ДФ=HH:mm") +
			" по " + Формат(Объект.Дата + СекундУрока(Объект.КоличествоЧасов), "ДФ=HH:mm") + " не входит в график учета рабочего времени педагога "
			+ ИтогПроверки.Педагог + " (" + Формат(ИтогПроверки.Дата, "ДФ='ММММ гггг ""г"".'") + ")";
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

	Пересечение = ДокументПересекаетсяСДругими(Объект);
	Если Пересечение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Пересечение.Поле = "Педагог" Тогда
		Кто = "педагог " + Пересечение.Педагог + " занят";
	Иначе
		Кто = "помещение " + Пересечение.Помещение + " занято";
	КонецЕсли;

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Урок № %1 от %2 с %3 по %4 пересекается по времени с уроком № %5 с %6 по %7: %8. Урок не проведён",
		Номер, Формат(Объект.Дата, "ДФ=dd.MM.yyyy"), Формат(Объект.Дата, "ДФ=HH:mm"),
		Формат(Объект.Дата + СекундУрока(Объект.КоличествоЧасов), "ДФ=HH:mm"),
		НомерБезНулей(Пересечение.Номер), Формат(Пересечение.Дата, "ДФ=HH:mm"),
		Формат(Пересечение.Дата + СекундУрока(Пересечение.КоличествоЧасов), "ДФ=HH:mm"), Кто);
	Сообщение.Поле = Пересечение.Поле;
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	Отказ = Истина;

КонецПроцедуры

#Область ПомощникУроков

//Помощник создания уроков (Codex N03): записать учеников в урок на дату. В существующий урок — только если это
//именно заданный урок: то же начало, группа, педагог, предмет и помещение (прежде группа и педагог в поиске были
//закомментированы — ученик группы Б попадал в урок группы А того же помещения; подходил и любой более короткий урок
//внутри интервала). Такого урока нет — создаётся новый, но не поверх чужого: урок того же педагога, в том же
//помещении или той же группы, пересекающийся по времени (проведённый или записанный планом), — отказ с причиной.
//Проведённый урок при добавлении учеников перепроводится всегда (Codex A01, УЗ_Общий.ЗаписатьУрок).
//
//Параметры:
//  ПараметрыУрока - Структура - Дата (начало урока), КоличествоЧасов, ПредметОбучения, Педагог, Помещение,
//                   ГруппаОбучения; необязательные Статус, Тариф
//  Ученики - Массив из Структура - Ученик и необязательные Тариф, Скидка, СписатьОплату, Явка, Абонемент
//  Провести - Булево - провести урок (не начавшийся только записывается, В10); Ложь — записать без проведения
//
//Возвращаемое значение:
//  Структура - Успех; Урок - ДокументСсылка.УЗ_Урок или Неопределено; Создан - Булево;
//              Строки - Массив из Структура(Описание, Урок) — строки журнала помощника.
Функция ЗаписатьУчениковВУрок(ПараметрыУрока, Ученики, Провести) Экспорт

	Итог = НовыйИтогПомощника();
	Начало = ПараметрыУрока.Дата;
	Найденные = УрокиПомощникаНаДату(ПараметрыУрока);
	Если Найденные.Количество() > 1 Тогда
		Итог.Успех = Ложь;
		ДобавитьСтрокуПомощника(Итог, СтрШаблон(НСтр("ru = 'На %1 уже %2 урока с этими группой, педагогом, предметом и помещением — ученики не добавлены'"),
			Формат(Начало, "ДЛФ=DT"), Найденные.Количество()), Найденные[0].Ссылка);
		Возврат Итог;
	КонецЕсли;

	Если Найденные.Количество() = 1 Тогда
		Найденный = Найденные[0];
		Если СекундУрока(Найденный.КоличествоЧасов) <> СекундУрока(ПараметрыУрока.КоличествоЧасов) Тогда
			Итог.Успех = Ложь;
			ДобавитьСтрокуПомощника(Итог, СтрШаблон(НСтр("ru = 'На %1 уже есть урок № %2 другой длительности (%3 мин, задано %4 мин) — ученики не добавлены'"),
				Формат(Начало, "ДЛФ=DT"), НомерБезНулей(Найденный.Номер), СекундУрока(Найденный.КоличествоЧасов) / 60,
				СекундУрока(ПараметрыУрока.КоличествоЧасов) / 60), Найденный.Ссылка);
			Возврат Итог;
		КонецЕсли;
		Урок = Найденный.Ссылка.ПолучитьОбъект();
	Иначе
		Урок = Документы.УЗ_Урок.СоздатьДокумент();
		Урок.Дата = Начало;
		Урок.КоличествоЧасов = ПараметрыУрока.КоличествоЧасов;
		Урок.ПредметОбучения = ПараметрыУрока.ПредметОбучения;
		Урок.Педагог = ПараметрыУрока.Педагог;
		Урок.Помещение = ПараметрыУрока.Помещение;
		Урок.ГруппаОбучения = ПараметрыУрока.ГруппаОбучения;
		Если ПараметрыУрока.Свойство("Статус") Тогда
			Урок.Статус = ПараметрыУрока.Статус;
		КонецЕсли;
		Если ПараметрыУрока.Свойство("Тариф") Тогда
			Урок.Тариф = ПараметрыУрока.Тариф;
		КонецЕсли;
		ЗаполнитьСтавкуПедагога(Урок); //ставка группы, иначе педагога
		ТекстКонфликта = КонфликтНовогоУрокаПомощника(Урок);
		Если ТекстКонфликта <> "" Тогда
			Итог.Успех = Ложь;
			ДобавитьСтрокуПомощника(Итог, ТекстКонфликта);
			Возврат Итог;
		КонецЕсли;
		Итог.Создан = Истина;
	КонецЕсли;

	Добавлено = 0;
	Для Каждого ДанныеУченика Из Ученики Цикл
		Если Не ЗначениеЗаполнено(ДанныеУченика.Ученик) Тогда
			Продолжить;
		КонецЕсли;
		//ученик уже в уроке (или дважды в таблице помощника) — второй строкой не добавляется: двойное списание
		Если Урок.Ученики.Найти(ДанныеУченика.Ученик, "Ученик") <> Неопределено Тогда
			Если Не Итог.Создан Тогда
				ДобавитьСтрокуПомощника(Итог, СтрШаблон(НСтр("ru = 'Ученик %1 уже присутствует в уроке № %2 от %3 с %4 по %5. Пропускаем...'"),
					ДанныеУченика.Ученик, НомерБезНулей(Урок.Номер), Формат(Урок.Дата, "ДФ=dd.MM.yyyy"), Формат(Урок.Дата, "ДФ=HH:mm"),
					Формат(Урок.Дата + СекундУрока(Урок.КоличествоЧасов), "ДФ=HH:mm")), Урок.Ссылка);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		СтрокаУченика = Урок.Ученики.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУченика, ДанныеУченика);
		Добавлено = Добавлено + 1;
	КонецЦикла;

	Если Добавлено = 0 И Не Итог.Создан Тогда
		Итог.Урок = Урок.Ссылка;
		Возврат Итог;
	КонецЕсли;

	Записан = УЗ_Общий.ЗаписатьУрок(Урок, Провести);
	Если ЗначениеЗаполнено(Урок.Ссылка) Тогда
		Итог.Урок = Урок.Ссылка;
	КонецЕсли;
	Если Не Записан.Успех Тогда
		Итог.Успех = Ложь;
		ДобавитьСтрокуПомощника(Итог, ?(Итог.Создан, НСтр("ru = 'Не удалось создать урок! '"),
			НСтр("ru = 'Не удалось записать урок! '")) + Записан.Текст, Итог.Урок);
		Возврат Итог;
	КонецЕсли;
	ДобавитьСтрокуПомощника(Итог, ?(Итог.Создан, НСтр("ru = 'Создан'"), НСтр("ru = 'Выполнено добавление учеников'"))
		+ ?(Записан.Пометка = "", "", " — " + Записан.Пометка), Итог.Урок);
	Возврат Итог;

КонецФункции

//Перевод учеников в урок на дату (страница «Перевод из группы» помощника, Codex Q03): ученики убираются из уроков
//группы ИзГруппы в день урока и записываются в урок ПараметрыУрока (ЗаписатьУчениковВУрок) — в одной транзакции.
//Не записался хоть один урок — не меняется ничего: прежде старые уроки менялись до попытки записать новый, и отказ
//нового урока (нет цены, пересечение) оставлял ученика без занятий.
//Параметры и результат — как у ЗаписатьУчениковВУрок; при отказе Строки — одна строка с причиной.
Функция ПеревестиУчениковВУрок(ПараметрыУрока, ИзГруппы, Ученики, Провести) Экспорт

	Итог = НовыйИтогПомощника();
	НачатьТранзакцию();
	Попытка
		Для Каждого ДанныеУченика Из Ученики Цикл
			Если Не ЗначениеЗаполнено(ДанныеУченика.Ученик) Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого СсылкаУрока Из УрокиГруппыСУченикомНаДень(ИзГруппы, ДанныеУченика.Ученик, ПараметрыУрока.Дата) Цикл
				Урок = СсылкаУрока.ПолучитьОбъект();
				Для Каждого СтрокаУченика Из Урок.Ученики.НайтиСтроки(Новый Структура("Ученик", ДанныеУченика.Ученик)) Цикл
					Урок.Ученики.Удалить(СтрокаУченика);
				КонецЦикла;
				Если Урок.Ученики.Количество() = 0 Тогда
					Урок.УстановитьПометкуУдаления(Истина);
					ДобавитьСтрокуПомощника(Итог, НСтр("ru = 'Удален урок. Перевод из группы ученика '") + ДанныеУченика.Ученик, СсылкаУрока);
				Иначе
					Записан = УЗ_Общий.ЗаписатьУрок(Урок, Провести);
					Если Не Записан.Успех Тогда
						ВызватьИсключение СтрШаблон(НСтр("ru = 'урок %1 группы %2 не записан: %3'"), СсылкаУрока, ИзГруппы, Записан.Текст);
					КонецЕсли;
					ДобавитьСтрокуПомощника(Итог, НСтр("ru = 'Изменен урок. Перевод из группы ученика '") + ДанныеУченика.Ученик
						+ ?(Записан.Пометка = "", "", " — " + Записан.Пометка), СсылкаУрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ВУрок = ЗаписатьУчениковВУрок(ПараметрыУрока, Ученики, Провести);
		Для Каждого СтрокаЖурнала Из ВУрок.Строки Цикл
			Итог.Строки.Добавить(СтрокаЖурнала);
		КонецЦикла;
		Если Не ВУрок.Успех Тогда
			ВызватьИсключение ВУрок.Строки[ВУрок.Строки.Количество() - 1].Описание;
		КонецЕсли;
		Итог.Урок = ВУрок.Урок;
		Итог.Создан = ВУрок.Создан;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Итог = НовыйИтогПомощника();
		Итог.Успех = Ложь;
		ДобавитьСтрокуПомощника(Итог, СтрШаблон(НСтр("ru = 'Перевод на %1 отменён, прежние уроки не изменены: %2'"),
			Формат(ПараметрыУрока.Дата, "ДЛФ=DT"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	Возврат Итог;

КонецФункции

Функция НовыйИтогПомощника()
	Возврат Новый Структура("Успех, Урок, Создан, Строки", Истина, Неопределено, Ложь, Новый Массив);
КонецФункции

Процедура ДобавитьСтрокуПомощника(Итог, Описание, Урок = Неопределено)
	Итог.Строки.Добавить(Новый Структура("Описание, Урок", Описание, Урок));
КонецПроцедуры

//Непомеченные на удаление уроки (проведённые и записанные планом) ровно с заданными началом, группой, педагогом,
//предметом и помещением.
Функция УрокиПомощникаНаДату(ПараметрыУрока)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Урок.Ссылка КАК Ссылка,
	|	Урок.Номер КАК Номер,
	|	Урок.КоличествоЧасов КАК КоличествоЧасов
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	НЕ Урок.ПометкаУдаления
	|	И Урок.Дата = &Дата
	|	И Урок.ГруппаОбучения = &ГруппаОбучения
	|	И Урок.Педагог = &Педагог
	|	И Урок.ПредметОбучения = &ПредметОбучения
	|	И Урок.Помещение = &Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Урок.Проведен УБЫВ";
	Запрос.УстановитьПараметр("Дата", ПараметрыУрока.Дата);
	Запрос.УстановитьПараметр("ГруппаОбучения", ПараметрыУрока.ГруппаОбучения);
	Запрос.УстановитьПараметр("Педагог", ПараметрыУрока.Педагог);
	Запрос.УстановитьПараметр("ПредметОбучения", ПараметрыУрока.ПредметОбучения);
	Запрос.УстановитьПараметр("Помещение", ПараметрыУрока.Помещение);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//Почему новый урок помощника нельзя записать поверх других: урок того же педагога или в том же помещении
//(ДокументПересекаетсяСДругими, включая записанные планом) либо урок той же группы, пересекающийся по времени.
//Возврат: текст отказа или "".
Функция КонфликтНовогоУрокаПомощника(Урок)

	Пересечение = ДокументПересекаетсяСДругими(Урок, Истина);
	Если Пересечение <> Неопределено Тогда
		Если Пересечение.Поле = "Педагог" Тогда
			Кто = СтрШаблон(НСтр("ru = 'педагог %1 занят'"), Пересечение.Педагог);
		Иначе
			Кто = СтрШаблон(НСтр("ru = 'помещение %1 занято'"), Пересечение.Помещение);
		КонецЕсли;
		Возврат СтрШаблон(НСтр("ru = 'Урок на %1 не создан: %2 уроком № %3 с %4 по %5'"), Формат(Урок.Дата, "ДЛФ=DT"), Кто,
			НомерБезНулей(Пересечение.Номер), Формат(Пересечение.Дата, "ДФ=HH:mm"),
			Формат(Пересечение.Дата + СекундУрока(Пересечение.КоличествоЧасов), "ДФ=HH:mm"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Урок.ГруппаОбучения) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Урок.Номер КАК Номер,
	|	Урок.Дата КАК Дата,
	|	Урок.КоличествоЧасов КАК КоличествоЧасов,
	|	Урок.Педагог КАК Педагог,
	|	Урок.ПредметОбучения КАК ПредметОбучения,
	|	Урок.Помещение КАК Помещение
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	НЕ Урок.ПометкаУдаления
	|	И Урок.ГруппаОбучения = &ГруппаОбучения
	|	И Урок.Дата > &НачалоПоиска
	|	И Урок.Дата < &Окончание
	|	И ДОБАВИТЬКДАТЕ(Урок.Дата, СЕКУНДА, ВЫБОР
	|				КОГДА Урок.КоличествоЧасов > 0
	|					ТОГДА Урок.КоличествоЧасов * 3600 - 30
	|				ИНАЧЕ 1
	|			КОНЕЦ) > &Начало
	|
	|УПОРЯДОЧИТЬ ПО
	|	Урок.Дата";
	Запрос.УстановитьПараметр("ГруппаОбучения", Урок.ГруппаОбучения);
	Запрос.УстановитьПараметр("Начало", Урок.Дата);
	Запрос.УстановитьПараметр("Окончание", Урок.Дата + Макс(СекундУрока(Урок.КоличествоЧасов), 1));
	Запрос.УстановитьПараметр("НачалоПоиска", Урок.Дата - 86400);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат "";
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Урок на %1 не создан: у группы %2 уже есть урок № %3 с %4 по %5 (педагог %6, предмет %7, помещение %8) — задайте те же педагога, предмет, помещение и время, чтобы добавить учеников в него'"),
		Формат(Урок.Дата, "ДЛФ=DT"), Урок.ГруппаОбучения, НомерБезНулей(Выборка.Номер), Формат(Выборка.Дата, "ДФ=HH:mm"),
		Формат(Выборка.Дата + СекундУрока(Выборка.КоличествоЧасов), "ДФ=HH:mm"), Выборка.Педагог, Выборка.ПредметОбучения,
		Выборка.Помещение);

КонецФункции

//Непомеченные на удаление уроки группы в день Дата, где есть ученик.
Функция УрокиГруппыСУченикомНаДень(ГруппаОбучения, Ученик, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УрокУченики.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	УрокУченики.Ученик = &Ученик
	|	И НЕ УрокУченики.Ссылка.ПометкаУдаления
	|	И УрокУченики.Ссылка.ГруппаОбучения = &ГруппаОбучения
	|	И УрокУченики.Ссылка.Дата МЕЖДУ &Начало И &Окончание";
	Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
	Запрос.УстановитьПараметр("Ученик", Ученик);
	Запрос.УстановитьПараметр("Начало", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Окончание", КонецДня(Дата));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти
